<h1 id="tocheading">Table of Contents</h1>
<div id="toc"></div>

In [1]:
%%javascript
$.getScript('https://kmahelona.github.io/ipython_notebook_goodies/ipython_notebook_toc.js')

### 584. Find Customer Referee

Given a table customer holding customers information and the referee.
+------+------+-----------+
| id   | name | referee_id|
+------+------+-----------+
|    1 | Will |      NULL |
|    2 | Jane |      NULL |
|    3 | Alex |         2 |
|    4 | Bill |      NULL |
|    5 | Zack |         1 |
|    6 | Mark |         2 |
+------+------+-----------+
Write a query to return the list of customers NOT referred by the person with id '2'.

For the sample data above, the result is:
+------+
| name |
+------+
| Will |
| Jane |
| Bill |
| Zack |
+------+

```mysql
SELECT name
FROM customer
WHERE referee_id!=2 OR referee_id IS NULL
```

### 585. Investments in 2016

Write a query to print the sum of all total investment values in 2016 (TIV_2016), to a scale of 2 decimal places, for all policy holders who meet the following criteria:

Have the same TIV_2015 value as one or more other policyholders.
Are not located in the same city as any other policyholder (i.e.: the (latitude, longitude) attribute pairs must be unique).
Input Format:
The insurance table is described as follows:
| Column Name | Type          |
|-------------|---------------|
| PID         | INTEGER(11)   |
| TIV_2015    | NUMERIC(15,2) |
| TIV_2016    | NUMERIC(15,2) |
| LAT         | NUMERIC(5,2)  |
| LON         | NUMERIC(5,2)  |
where PID is the policyholder's policy ID, TIV_2015 is the total investment value in 2015, TIV_2016 is the total investment value in 2016, LAT is the latitude of the policy holder's city, and LON is the longitude of the policy holder's city.

Sample Input
| PID | TIV_2015 | TIV_2016 | LAT | LON |
|-----|----------|----------|-----|-----|
| 1   | 10       | 5        | 10  | 10  |
| 2   | 20       | 20       | 20  | 20  |
| 3   | 10       | 30       | 20  | 20  |
| 4   | 10       | 40       | 40  | 40  |
Sample Output
| TIV_2016 |
|----------|
| 45.00    |

Explanation
The first record in the table, like the last record, meets both of the two criteria.
The TIV_2015 value '10' is as the same as the third and forth record, and its location unique.
The second record does not meet any of the two criteria. Its TIV_2015 is not like any other policyholders.
And its location is the same with the third record, which makes the third record fail, too.
So, the result is the sum of TIV_2016 of the first and last record, which is 45.

```mysql
SELECT SUM(i.TIV_2016) AS TIV_2016
FROM insurance i
JOIN (
    SELECT lat, lon
    FROM insurance
    GROUP BY lat, lon
    HAVING COUNT(pid)=1
) AS X
ON i.lat=x.lat AND i.lon=x.lon
WHERE TIV_2015 IN (
    SELECT TIV_2015
    FROM insurance
    GROUP BY TIV_2015
    HAVING COUNT(tiv_2015)>1)

/*SELECT SUM(TIV_2016) AS TIV_2016
FROM insurance
WHERE TIV_2015 IN (
    SELECT TIV_2015
    FROM insurance
    GROUP BY TIV_2015
    HAVING COUNT(tiv_2015)>1)
AND CONCAT_WS(',', lat, lon) IN (
    SELECT CONCAT_WS(',', lat, lon)
    FROM insurance
    GROUP BY CONCAT_WS(',', lat, lon)
    HAVING COUNT(pid)=1)*/
```

### 586. Customer Placing the Largest Number of Orders

Query the customer_number from the orders table for the customer who has placed the largest number of orders.
It is guaranteed that exactly one customer will have placed more orders than any other customer.

The orders table is defined as follows:
| Column            | Type      |
|-------------------|-----------|
| order_number (PK) | int       |
| customer_number   | int       |
| order_date        | date      |
| required_date     | date      |
| shipped_date      | date      |
| status            | char(15)  |
| comment           | char(200) |

Sample Input
| order_number | customer_number | order_date | required_date | shipped_date | status | comment |
|--------------|-----------------|------------|---------------|--------------|--------|---------|
| 1            | 1               | 2017-04-09 | 2017-04-13    | 2017-04-12   | Closed |         |
| 2            | 2               | 2017-04-15 | 2017-04-20    | 2017-04-18   | Closed |         |
| 3            | 3               | 2017-04-16 | 2017-04-25    | 2017-04-20   | Closed |         |
| 4            | 3               | 2017-04-18 | 2017-04-28    | 2017-04-25   | Closed |         |
Sample Output
| customer_number |
|-----------------|
| 3               |

Explanation
The customer with number '3' has two orders, which is greater than either customer '1' or '2' because each of them  only has one order. 
So the result is customer_number '3'.
Follow up: What if more than one customer have the largest number of orders, can you find all the customer_number in this case?

```mysql
/*SELECT customer_number
FROM orders
GROUP BY customer_number
HAVING COUNT(*) = (
    SELECT MAX(X.n_order)
    FROM (
        SELECT customer_number, COUNT(*) as n_order
        FROM orders
        GROUP BY customer_number) AS X)*/
SELECT customer_number
FROM orders
GROUP BY customer_number
HAVING COUNT(*) >= ALL(
    SELECT COUNT(*) as n_order
    FROM orders
    GROUP BY customer_number)
```

### 595. Big Countries

There is a table World
+-----------------+------------+------------+--------------+---------------+
| name            | continent  | area       | population   | gdp           |
+-----------------+------------+------------+--------------+---------------+
| Afghanistan     | Asia       | 652230     | 25500100     | 20343000      |
| Albania         | Europe     | 28748      | 2831741      | 12960000      |
| Algeria         | Africa     | 2381741    | 37100000     | 188681000     |
| Andorra         | Europe     | 468        | 78115        | 3712000       |
| Angola          | Africa     | 1246700    | 20609294     | 100990000     |
+-----------------+------------+------------+--------------+---------------+
A country is big if it has an area of bigger than 3 million square km or a population of more than 25 million.

Write a SQL solution to output big countries' name, population and area.
For example, according to the above table, we should output:
+--------------+-------------+--------------+
| name         | population  | area         |
+--------------+-------------+--------------+
| Afghanistan  | 25500100    | 652230       |
| Algeria      | 37100000    | 2381741      |
+--------------+-------------+--------------+

```mysql
SELECT name, population, area
FROM World
WHERE area>3000000 OR population>25000000
```

### 596. Classes More Than 5 Students

There is a table courses with columns: student and class
Please list out all classes which have more than or equal to 5 students.

For example, the table:
+---------+------------+
| student | class      |
+---------+------------+
| A       | Math       |
| B       | English    |
| C       | Math       |
| D       | Biology    |
| E       | Math       |
| F       | Computer   |
| G       | Math       |
| H       | Math       |
| I       | Math       |
+---------+------------+
Should output:
+---------+
| class   |
+---------+
| Math    |
+---------+

```mysql
SELECT class
FROM courses
GROUP BY class
HAVING COUNT(DISTINCT student)>=5
```

### 597. Friend Requests I: Overall Acceptance Rate

In social network like Facebook or Twitter, people send friend requests and accept others’ requests as well. Now given two tables as below:
Table: friend_request
| sender_id | send_to_id |request_date|
|-----------|------------|------------|
| 1         | 2          | 2016_06-01 |
| 1         | 3          | 2016_06-01 |
| 1         | 4          | 2016_06-01 |
| 2         | 3          | 2016_06-02 |
| 3         | 4          | 2016-06-09 |

Table: request_accepted
| requester_id | accepter_id |accept_date |
|--------------|-------------|------------|
| 1            | 2           | 2016_06-03 |
| 1            | 3           | 2016-06-08 |
| 2            | 3           | 2016-06-08 |
| 3            | 4           | 2016-06-09 |
| 3            | 4           | 2016-06-10 |

Write a query to find the overall acceptance rate of requests rounded to 2 decimals, which is the number of acceptance divide the number of requests.
For the sample data above, your query should return the following result.
|accept_rate|
|-----------|
|       0.80|

Note:
The accepted requests are not necessarily from the table friend_request. In this case, you just need to simply count the total accepted requests (no matter whether they are in the original requests), and divide it by the number of requests to get the acceptance rate.
It is possible that a sender sends multiple requests to the same receiver, and a request could be accepted more than once. In this case, the ‘duplicated’ requests or acceptances are only counted once.
If there is no requests at all, you should return 0.00 as the accept_rate.

Explanation: There are 4 unique accepted requests, and there are 5 requests in total. So the rate is 0.80.

Follow-up:
Can you write a query to return the accept rate but for every month?
How about the cumulative accept rate for every day?

```mysql
SELECT ROUND(IFNULL(COUNT(DISTINCT requester_id, accepter_id)/COUNT(DISTINCT sender_id, send_to_id), 0), 2) AS accept_rate
FROM friend_request, request_accepted

# acceptance rate for each month
/* SELECT IFNULL(n_acc/n_req, 0) as accept_rate
FROM (
    SELECT A.mon, n_req, n_acc
    FROM (SELECT month(request_date) as mon, count(distinct sender_id, send_to_id) as n_req
    FROM friend_request
    GROUP BY month(request_date)) AS A
    JOIN (SELECT month(accept_date) as mon, count(distinct requester_id, accepter_id) as n_acc
    FROM request_accepted
    GROUP BY month(accept_date)) AS B
    ON A.mon=B.mon) AS C*/
```

### 601. Human Traffic of Stadium

X city built a new stadium, each day many people visit it and the stats are saved as these columns: id, visit_date, people
Please write a query to display the records which have 3 or more consecutive rows and the amount of people more than 100(inclusive).

For example, the table stadium:
+------+------------+-----------+
| id   | visit_date | people    |
+------+------------+-----------+
| 1    | 2017-01-01 | 10        |
| 2    | 2017-01-02 | 109       |
| 3    | 2017-01-03 | 150       |
| 4    | 2017-01-04 | 99        |
| 5    | 2017-01-05 | 145       |
| 6    | 2017-01-06 | 1455      |
| 7    | 2017-01-07 | 199       |
| 8    | 2017-01-08 | 188       |
+------+------------+-----------+
For the sample data above, the output is:
+------+------------+-----------+
| id   | visit_date | people    |
+------+------------+-----------+
| 5    | 2017-01-05 | 145       |
| 6    | 2017-01-06 | 1455      |
| 7    | 2017-01-07 | 199       |
| 8    | 2017-01-08 | 188       |
+------+------------+-----------+

Note:
Each day only have one row record, and the dates are increasing with id increasing.

```mysql
-- MYSQL
SELECT id, visit_date , people
FROM stadium
WHERE people > 99
AND ( ((id-1 IN (SELECT id FROM stadium WHERE people > 99 ))
    and (id-2 IN (SELECT id FROM stadium WHERE people > 99 )))
OR ((id -1 IN (SELECT id FROM stadium WHERE people > 99 ))
    and (id +1 IN (SELECT id FROM stadium WHERE people > 99 )) )
OR ((id+1 IN (SELECT id FROM stadium WHERE people > 99 ))
    and (id+2 IN (SELECT id FROM stadium WHERE people > 99 ))) )
-- SQL server
         /* WRONG WHERE CONDITIONS */
/*SELECT id, visit_date, people
FROM (
    SELECT id, visit_date, people,
        MIN(people) OVER (ORDER BY id ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) as min_before,
        MIN(people) OVER (ORDER BY id ROWS BETWEEN CURRENT ROW AND 2 FOLLOWING) as min_after,
        ROW_NUMBER() OVER (ORDER BY id) as row,
        COUNT(id) OVER () as n_rows
    FROM stadium ) x
WHERE (min_after>=100 and row<=2)
OR (min_before>=100 and row>(n_rows-2))
OR ((min_before>=100 or min_after>=100)and (row>2 and row<=(n_rows-2)) )*/

SELECT a.id, a.visit_date, a.people
FROM (
    SELECT id, visit_date, people,
    LAG(people, 2) OVER (ORDER BY visit_date) as m2,
    LAG(people, 1) OVER (ORDER BY visit_date) as m1,
    LEAD(people, 1) OVER (ORDER BY visit_date) as p1, 
    LEAD(people, 2) OVER (ORDER BY visit_date) as p2
    FROM stadium) a
WHERE
    (a.people>=100 and a.p1>=100 and a.p2>=100)
or  (a.m2>=100 and a.m1>=100 and a.people>=100)
or  (a.m1>=100 and a.people>=100 and a.p1>=100)
```

### 602. Friend Requests II: Who Has the Most Friends

In social network like Facebook or Twitter, people send friend requests and accept others' requests as well.

Table request_accepted
+--------------+-------------+------------+
| requester_id | accepter_id | accept_date|
|--------------|-------------|------------|
| 1            | 2           | 2016_06-03 |
| 1            | 3           | 2016-06-08 |
| 2            | 3           | 2016-06-08 |
| 3            | 4           | 2016-06-09 |
+--------------+-------------+------------+
This table holds the data of friend acceptance, while requester_id and accepter_id both are the id of a person.

Write a query to find the the people who has most friends and the most friends number under the following rules:
It is guaranteed there is only 1 people having the most friends.
The friend request could only been accepted once, which mean there is no multiple records with the same requester_id and accepter_id value.
For the sample data above, the result is:

Result table:
+------+------+
| id   | num  |
|------|------|
| 3    | 3    |
+------+------+
The person with id '3' is a friend of people '1', '2' and '4', so he has 3 friends in total, which is the most number than any others.
Follow-up:
In the real world, multiple people could have the same most number of friends, can you find all these people in this case?

```mysql
-- MYSQL
SELECT id, num
FROM (
    SELECT id, SUM(cnt) AS num
    FROM (
        SELECT requester_id as id, count(accepter_id) as cnt
        FROM request_accepted a
        GROUP BY requester_id
        UNION ALL
        SELECT accepter_id as id, count(requester_id) as cnt
        FROM request_accepted b
        GROUP BY accepter_id) AS x
    GROUP BY id) AS Y
ORDER BY num DESC
LIMIT 1

-- SQL server
SELECT id, num
FROM (
    SELECT id, num, RANK() OVER (ORDER BY num DESC) AS rnk
    FROM (
        SELECT id, SUM(cnt) AS num
        FROM (
            SELECT requester_id as id, count(accepter_id) as cnt
            FROM request_accepted
            GROUP BY requester_id
            UNION ALL
            SELECT accepter_id as id, count(requester_id) as cnt
            FROM request_accepted
            GROUP BY accepter_id) AS x
    GROUP BY id ) AS y
    ) AS z
WHERE rnk=1
```

### 603. Consecutive Available Seats

Several friends at a cinema ticket office would like to reserve consecutive available seats.
Can you help to query all the consecutive available seats order by the seat_id using the following cinema table?
| seat_id | free |
|---------|------|
| 1       | 1    |
| 2       | 0    |
| 3       | 1    |
| 4       | 1    |
| 5       | 1    |

Your query should return the following result for the sample case above.
| seat_id |
|---------|
| 3       |
| 4       |
| 5       |
Note:
The seat_id is an auto increment int, and free is bool ('1' means free, and '0' means occupied.).
Consecutive available seats are more than 2(inclusive) seats consecutively available.

```mysql
SELECT DISTINCT a.seat_id AS seat_id
FROM cinema as a
JOIN cinema as b
ON ABS(a.seat_id-b.seat_id)=1 AND (a.free=1 AND b.free=1)
ORDER BY seat_id

/*SELECT DISTINCT a.seat_id
FROM cinema as a
JOIN cinema as b
ON (a.seat_id=b.seat_id-1 AND (a.free=1 AND b.free=1) )
OR (a.seat_id=b.seat_id+1 AND (a.free=1 AND b.free=1) )*/
```

### 607. Sales Person

Given three tables: salesperson, company, orders.
Output all the names in the table salesperson, who didn’t have sales to company 'RED'.

Input
Table: salesperson
+----------+------+--------+-----------------+-----------+
| sales_id | name | salary | commission_rate | hire_date |
+----------+------+--------+-----------------+-----------+
|   1      | John | 100000 |     6           | 4/1/2006  |
|   2      | Amy  | 120000 |     5           | 5/1/2010  |
|   3      | Mark | 65000  |     12          | 12/25/2008|
|   4      | Pam  | 25000  |     25          | 1/1/2005  |
|   5      | Alex | 50000  |     10          | 2/3/2007  |
+----------+------+--------+-----------------+-----------+
The table salesperson holds the salesperson information. Every salesperson has a sales_id and a name.
Table: company
+---------+--------+------------+
| com_id  |  name  |    city    |
+---------+--------+------------+
|   1     |  RED   |   Boston   |
|   2     | ORANGE |   New York |
|   3     | YELLOW |   Boston   |
|   4     | GREEN  |   Austin   |
+---------+--------+------------+
The table company holds the company information. Every company has a com_id and a name.
Table: orders
+----------+------------+---------+----------+--------+
| order_id | order_date | com_id  | sales_id | amount |
+----------+------------+---------+----------+--------+
| 1        |   1/1/2014 |    3    |    4     | 100000 |
| 2        |   2/1/2014 |    4    |    5     | 5000   |
| 3        |   3/1/2014 |    1    |    1     | 50000  |
| 4        |   4/1/2014 |    1    |    4     | 25000  |
+----------+----------+---------+----------+--------+
The table orders holds the sales record information, salesperson and customer company are represented by sales_id and com_id.
output
+------+
| name | 
+------+
| Amy  | 
| Mark | 
| Alex |
+------+

Explanation
According to order '3' and '4' in table orders, it is easy to tell only salesperson 'John' and 'Alex' have sales to company 'RED',
so we need to output all the other names in table salesperson.

```mysql
SELECT name
FROM salesperson
WHERE sales_id NOT IN(
    SELECT DISTINCT a.sales_id
    FROM orders AS a
    JOIN company AS b
    ON a.com_id=b.com_id AND b.name='RED')
```

### 608. Tree Node

Given a table tree, id is identifier of the tree node and p_id is its parent node's id.
+----+------+
| id | p_id |
+----+------+
| 1  | null |
| 2  | 1    |
| 3  | 1    |
| 4  | 2    |
| 5  | 2    |
+----+------+
Each node in the tree can be one of three types:
Leaf: if the node is a leaf node.
Root: if the node is the root of the tree.
Inner: If the node is neither a leaf node nor a root node.

Write a query to print the node id and the type of the node. Sort your output by the node id. The result for the above sample is:
+----+------+
| id | Type |
+----+------+
| 1  | Root |
| 2  | Inner|
| 3  | Leaf |
| 4  | Leaf |
| 5  | Leaf |
+----+------+

Explanation

Node '1' is root node, because its parent node is NULL and it has child node '2' and '3'.
Node '2' is inner node, because it has parent node '1' and child node '4' and '5'.
Node '3', '4' and '5' is Leaf node, because they have parent node and they don't have child node.

And here is the image of the sample tree as below:
			  1
			/   \
                      2       3
                    /   \
                  4       5
Note
If there is only one node on the tree, you only need to output its root attributes.

```mysql
# left join solution
/*SELECT id,
    case when pid=0 then 'Root'
        when pid!=0 and cid!=0 then 'Inner'
        else 'Leaf'
    end AS Type
FROM (
    SELECT a.id as Id, count(a.p_id) as pid, count(b.id) as cid
    FROM tree a
    LEFT JOIN tree b
    ON a.id=b.p_id
    GROUP BY id) X*/

# sub query solution
select id as Id,
    case when p_id is null then 'Root'
         when id in (select p_id from tree) then 'Inner'
         else 'Leaf'
    end as Type
from tree
order by id
```

### 610. Triangle Judgement

A pupil Tim gets homework to identify whether three line segments could possibly form a triangle.
However, this assignment is very heavy because there are hundreds of records to calculate.

Could you help Tim by writing a query to judge whether these three sides can form a triangle, assuming table triangle holds the length of the three sides x, y and z.
| x  | y  | z  |
|----|----|----|
| 13 | 15 | 30 |
| 10 | 20 | 15 |
For the sample data above, your query should return the follow result:
| x  | y  | z  | triangle |
|----|----|----|----------|
| 13 | 15 | 30 | No       |
| 10 | 20 | 15 | Yes      |

```mysql
SELECT x, y, z,
    CASE WHEN x + y > z AND x + z > y AND y + z > x THEN 'Yes'
        ELSE 'No' END AS triangle
FROM triangle
```